# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [4]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [5]:
cur.execute('''SELECT firstName FROM employees
                JOIN offices WHERE city = 'Boston' ''').fetchall()

[('Diane',),
 ('Mary',),
 ('Jeff',),
 ('William',),
 ('Gerard',),
 ('Anthony',),
 ('Leslie',),
 ('Leslie',),
 ('Julie',),
 ('Steve',),
 ('Foon Yue',),
 ('George',),
 ('Loui',),
 ('Gerard',),
 ('Pamela',),
 ('Larry',),
 ('Barry',),
 ('Andy',),
 ('Peter',),
 ('Tom',),
 ('Mami',),
 ('Yoshimi',),
 ('Martin',)]

## Do any offices have no employees?

In [7]:
#cur.execute('''SELECT * FROM offices ;''').fetchall()
cur.execute("""select * from offices
                        join employees
                        where employeeNumber IS NULL;
                       """).fetchall()
# no?

[]

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [10]:
# Your code here
cur.execute("""select * from products;""")
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df. columns = [i[0] for i in cur.description]
df.head
()

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
count,110,110,110,110,110,110,110,110,110
unique,110,110,7,8,13,95,110,108,108
top,S50_1341,1932 Alfa Romeo 8C2300 Spider Sport,Classic Cars,1:18,Classic Metal Creations,Turnable front wheels; steering function; deta...,737,77.90,50.31
freq,1,1,38,42,10,4,1,2,2

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [ ]:
# Your code here

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!